#! /usr/bin/env sage

from sage import *

def main():
	N_part = ["103812409689464886276475047044770609297885893720146571798654593885477457188",
			  "425375786047017735691464865799751262776976174291152757506033948402223696021",
			  "505470811665108707476725788296289255777914656800454451779117367605227364391",
			  "483323666809650532860469176398816220707851639905500304208833022438234033264",
			  "200398959"]
	N = Integer("".join(N_part))
	e = 3
	#открытый текст :"password is : kks\n"	
	C_part = ["938238084012027995683881429658324874262314418162537898338799613290825927539",
		      "337100231765251917021204970452072017705531145744599016"]
	C = Integer("".join(C_part))
	#известная часть атакующему: "password is : "
	known = 9789736874704569123418779948020899032072192
	R.<x> = PolynomialRing(Zmod(N), implementation='NTL')
	f = R((x+known)**e-C)
	#чем меньше параметр epsilon, тем медленнее работает алгоритм,
	#но тем больше вероятность верного результата
	root = f.small_roots(epsilon=0.02)[0]	
	#перевод открытого текста M в читаемый вид
	pad_hex = hex(int(root))[2:-1]
	pad = [chr(int(pad_hex[2*i]+pad_hex[2*i+1],16)) for i in range(len(pad_hex)//2)]
	padding = "".join(pad)
	print(f"паддинг : {padding}")

if __name__ == '__main__':
	main()
